{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/kschwarz/repos/labor-code-release-2020/logs/rf_uninteracted_reg_FEs.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}28 Aug 2020, 12:40:40
{txt}
{com}. 
. * select dataset and output folder
. loc reg_folder  "${c -(}DIR_STER{c )-}/uninteracted_reg_comlohi"
{txt}
{com}. loc rf_folder   "${c -(}DIR_RF{c )-}/uninteracted_reg_comlohi"
{txt}
{com}. 
. * other selections
. global ref_temp 27 
{txt}
{com}. 
. * full response function
. numlist "-20(0.1)47"
{txt}
{com}. gl full_response `r(numlist)'
{txt}
{com}. * 6 table values
. numlist "40 35 30 10 5 0"
{txt}
{com}. gl table_values `r(numlist)'
{txt}
{com}. 
. ***********************************
. *       GENERATE RESPONSE FUNCTION CSV
. ***********************************
. 
. foreach row_values in full_response table_values {c -(}
{txt}  2{com}. 
.         clear 
{txt}  3{com}. 
.         * set the ster file names and the output CSV
.         local comm_ster         "`reg_folder'/uninteracted_reg_common.ster"
{txt}  4{com}.         local by_risk_ster      "`reg_folder'/uninteracted_reg_by_risk.ster"
{txt}  5{com}.         local rf_name           "`rf_folder'/uninteracted_reg_comlohi_`row_values'.csv"
{txt}  6{com}. 
.         * create the temp list that we want to predict for
.         qui make_temp_dist, list($`row_values') ref($ref_temp)
{txt}  7{com}. 
.         * need this blank variable to get standard errors in predictnl
.         gen mins_worked = .
{txt}  8{com}. 
.         ********************** COMMON RESPONSE  **********************
. 
.         est use `comm_ster'
{txt}  9{com}. 
.         * generate spline terms and collect in macros
.         make_spline_terms 27 37 39
{txt} 10{com}.         collect_spline_terms, splines(0 1) unint(common) int(unused)
{txt} 11{com}. 
.         * predict common response
.         predictnl yhat_comm =   (T_spline0 - ref_spline0) * (${c -(}common0{c )-}) +                      ///
>                                                         (T_spline1 - ref_spline1) * (${c -(}common1{c )-}),                       ///
>                                                         ci(lowerci_comm upperci_comm) se(se_comm)
{txt} 12{com}. 
.         * drop estimated spline terms
.         keep *_comm min temp ref
{txt} 13{com}. 
. 
. 
.         ********************** BY-RISK RESPONSE **********************
. 
.         est use `by_risk_ster'
{txt} 14{com}. 
.         * generate spline terms and collect in macros
.         make_spline_terms 27 37 39
{txt} 15{com}.         collect_spline_terms, splines(0 1) unint(unint) int(int)
{txt} 16{com}. 
.         * predict response function by risk
.                 predictnl yhat_low =    (T_spline0 - ref_spline0) * (${c -(}unint0{c )-}) +                       ///
>                                                                 (T_spline1 - ref_spline1) * (${c -(}unint1{c )-}),                        ///
>                                                                 ci(lowerci_low upperci_low) se(se_low)
{txt} 17{com}. 
.                 predictnl yhat_high =   (T_spline0 - ref_spline0) * (${c -(}unint0{c )-} + ${c -(}int0{c )-}) +     ///
>                                                                 (T_spline1 - ref_spline1) * (${c -(}unint1{c )-} + ${c -(}int1{c )-}),      ///
>                                                                 ci(lowerci_high upperci_high) se(se_high)
{txt} 18{com}. 
.         drop T* ref_* min*
{txt} 19{com}.         export delim `rf_name', replace
{txt} 20{com}. 
. {c )-}
{txt}(671 missing values generated)
{res}matching these splines with the transformed-after-aggregated data
{txt}(200 real changes made)
(0 real changes made)
{res}{txt}note: confidence intervals calculated using Z critical values
{res}matching these splines with the transformed-after-aggregated data
{txt}(200 real changes made)
(0 real changes made)
{res}{txt}note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
{res}{txt}(note: file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_comlohi/uninteracted_reg_comlohi_full_response.csv not found)
{txt}file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_comlohi/uninteracted_reg_comlohi_full_response.csv saved
(6 missing values generated)
{res}matching these splines with the transformed-after-aggregated data
{txt}(3 real changes made)
(0 real changes made)
{res}{txt}note: confidence intervals calculated using Z critical values
{res}matching these splines with the transformed-after-aggregated data
{txt}(3 real changes made)
(0 real changes made)
{res}{txt}note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
{res}{txt}(note: file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_comlohi/uninteracted_reg_comlohi_table_values.csv not found)
{txt}file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_comlohi/uninteracted_reg_comlohi_table_values.csv saved

{com}. 
. 
. cap log close 
{smcl}
{com}{sf}{ul off}