{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/kschwarz/repos/labor-code-release-2020/logs/rf_uninteracted_reg_FEs.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 6 Oct 2020, 10:26:58
{txt}
{com}. 
. * select dataset and output folder
. loc reg_folder  "${c -(}DIR_STER{c )-}/uninteracted_reg_FEs"
{txt}
{com}. loc rf_folder   "${c -(}DIR_RF{c )-}/uninteracted_reg_FEs"
{txt}
{com}. 
. * other selections
. global fe_list fe_adm0_y fe_adm0_my fe_adm0_wk fe_adm3_my fe_adm0_m_y
{txt}
{com}. global ref_temp 27 
{txt}
{com}. 
. * full response function
. numlist "-20(0.1)47"
{txt}
{com}. gl full_response `r(numlist)'
{txt}
{com}. * 6 table values
. numlist "45 40 35 30 10 5 0"
{txt}
{com}. gl table_values `r(numlist)'
{txt}
{com}. 
. 
. ***********************************
. *       GENERATE RESPONSE FUNCTION CSVS
. ***********************************
. 
. foreach row_values in full_response table_values {c -(}
{txt}  2{com}. 
.         foreach fe in $fe_list {c -(}
{txt}  3{com}. 
.                 * set the ster file name and the output CSV
.                 local ster_name "`reg_folder'/uninteracted_reg_FE_`fe'.ster"
{txt}  4{com}.                 local rf_name   "`rf_folder'/uninteracted_reg_FE_`fe'_`row_values'.csv"
{txt}  5{com}.                 
.                 * create the temp list that we want to predict for
.                 qui make_temp_dist, list($`row_values') ref($ref_temp)
{txt}  6{com}.                 est use `ster_name'
{txt}  7{com}. 
.                 * generate spline terms and collect in macros
.                 make_spline_terms 27 37 39
{txt}  8{com}.                 collect_spline_terms, splines(0 1) unint(unint) int(int)
{txt}  9{com}. 
.                 * need this blank variable to get standard errors in predictnl
.                 gen mins_worked = .
{txt} 10{com}. 
.                 * predict response function by risk
.                         predictnl yhat_low =    (T_spline0 - ref_spline0) * (${c -(}unint0{c )-}) +                       ///
>                                                                         (T_spline1 - ref_spline1) * (${c -(}unint1{c )-}),                        ///
>                                                                         ci(lowerci_low upperci_low) se(se_low)
{txt} 11{com}. 
.                         predictnl yhat_high =   (T_spline0 - ref_spline0) * (${c -(}unint0{c )-} + ${c -(}int0{c )-}) +     ///
>                                                                         (T_spline1 - ref_spline1) * (${c -(}unint1{c )-} + ${c -(}int1{c )-}),      ///
>                                                                         ci(lowerci_high upperci_high) se(se_high)
{txt} 12{com}. 
.                 drop T* ref_* min*
{txt} 13{com}.                 export delim `rf_name', replace
{txt} 14{com}.                 clear
{txt} 15{com}. 
.         {c )-}
{txt} 16{com}. {c )-}
{res}matching these splines with the transformed-after-aggregated data
{txt}(200 real changes made)
(0 real changes made)
{res}{txt}(671 missing values generated)
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
{res}{txt}(note: file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_y_full_response.csv not found)
{txt}file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_y_full_response.csv saved
{res}matching these splines with the transformed-after-aggregated data
{txt}(200 real changes made)
(0 real changes made)
{res}{txt}(671 missing values generated)
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
{res}{txt}(note: file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_my_full_response.csv not found)
{txt}file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_my_full_response.csv saved
{res}matching these splines with the transformed-after-aggregated data
{txt}(200 real changes made)
(0 real changes made)
{res}{txt}(671 missing values generated)
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
{res}{txt}(note: file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_wk_full_response.csv not found)
{txt}file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_wk_full_response.csv saved
{res}matching these splines with the transformed-after-aggregated data
{txt}(200 real changes made)
(0 real changes made)
{res}{txt}(671 missing values generated)
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
{res}{txt}(note: file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm3_my_full_response.csv not found)
{txt}file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm3_my_full_response.csv saved
{res}matching these splines with the transformed-after-aggregated data
{txt}(200 real changes made)
(0 real changes made)
{res}{txt}(671 missing values generated)
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
{res}{txt}(note: file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_m_y_full_response.csv not found)
{txt}file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_m_y_full_response.csv saved
{res}matching these splines with the transformed-after-aggregated data
{txt}(4 real changes made)
(0 real changes made)
{res}{txt}(7 missing values generated)
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
{res}{txt}(note: file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_y_table_values.csv not found)
{txt}file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_y_table_values.csv saved
{res}matching these splines with the transformed-after-aggregated data
{txt}(4 real changes made)
(0 real changes made)
{res}{txt}(7 missing values generated)
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
{res}{txt}(note: file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_my_table_values.csv not found)
{txt}file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_my_table_values.csv saved
{res}matching these splines with the transformed-after-aggregated data
{txt}(4 real changes made)
(0 real changes made)
{res}{txt}(7 missing values generated)
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
{res}{txt}(note: file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_wk_table_values.csv not found)
{txt}file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_wk_table_values.csv saved
{res}matching these splines with the transformed-after-aggregated data
{txt}(4 real changes made)
(0 real changes made)
{res}{txt}(7 missing values generated)
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
{res}{txt}(note: file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm3_my_table_values.csv not found)
{txt}file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm3_my_table_values.csv saved
{res}matching these splines with the transformed-after-aggregated data
{txt}(4 real changes made)
(0 real changes made)
{res}{txt}(7 missing values generated)
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
{res}{txt}(note: file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_m_y_table_values.csv not found)
{txt}file /home/kschwarz/repos/labor-code-release-2020/output/rf/uninteracted_reg_FEs/uninteracted_reg_FE_fe_adm0_m_y_table_values.csv saved

{com}. 
. cap log close 
{smcl}
{com}{sf}{ul off}